<a href="https://colab.research.google.com/github/junio-firmino/Aprendizado_python/blob/master/Multi_df.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
eng_url = "/content/drive/MyDrive/eng.csv"
state_url = "/content/drive/MyDrive/state.csv"
liberal_url= "/content/drive/MyDrive/liberal_arts.csv"
ivies_url = "/content/drive/MyDrive/ivies.csv"

In [3]:
eng = pd.read_csv(eng_url)

In [4]:
state = pd.read_csv(state_url)

In [5]:
liberal = pd.read_csv(liberal_url)

In [6]:
ivies = pd.read_csv(ivies_url)

In [7]:
dfs = [eng,state,liberal,ivies]

In [8]:
pd.concat(dfs)

                                     School Name  ... Mid-Career Median Salary
0    Massachusetts Institute of Technology (MIT)  ...             $126,000.00
1       California Institute of Technology (CIT)  ...             $123,000.00
2                            Harvey Mudd College  ...             $122,000.00
3   Polytechnic University of New York, Brooklyn  ...             $114,000.00
4                                   Cooper Union  ...             $114,000.00
..                                           ...  ...                      ...
3                             Harvard University  ...             $124,000.00
4                     University of Pennsylvania  ...             $120,000.00
5                             Cornell University  ...             $110,000.00
6                               Brown University  ...             $109,000.00
7                            Columbia University  ...             $107,000.00

[249 rows x 4 columns]

In [9]:
set(eng['School Name']).difference(state['School Name'])

{'California Institute of Technology (CIT)',
 'Carnegie Mellon University (CMU)',
 'Colorado School of Mines',
 'Cooper Union',
 'Embry-Riddle Aeronautical University (ERAU)',
 'Georgia Institute of Technology',
 'Harvey Mudd College',
 'Illinois Institute of Technology (IIT)',
 'Massachusetts Institute of Technology (MIT)',
 'New Mexico Institute of Mining and Technology (New Mexico Tech)',
 'Polytechnic University of New York, Brooklyn',
 'Rensselaer Polytechnic Institute (RPI)',
 'Rochester Institute of Technology (RIT)',
 'South Dakota School of Mines & Technology',
 'Stevens Institute of Technology',
 'Tennessee Technological University',
 'Virginia Polytechnic Institute and State University (Virginia Tech)',
 'Wentworth Institute of Technology',
 'Worcester Polytechnic Institute (WPI)'}

In [10]:
'Cooper Union' in ivies['School Name'].values

False

In [11]:
schools = pd.concat(dfs).drop_duplicates(subset=['School Name'], keep='first')

In [12]:
schools.loc[19]

              School Name  ... Mid-Career Median Salary
19     Rutgers University  ...              $91,800.00
19  Mount Holyoke College  ...              $94,100.00

[2 rows x 4 columns]

In [13]:
schools_1 = schools.reset_index(drop=True)

In [14]:
schools_1.duplicated().sum()

0

In [15]:
schools_1

                                      School Name  ... Mid-Career Median Salary
0     Massachusetts Institute of Technology (MIT)  ...             $126,000.00
1        California Institute of Technology (CIT)  ...             $123,000.00
2                             Harvey Mudd College  ...             $122,000.00
3    Polytechnic University of New York, Brooklyn  ...             $114,000.00
4                                    Cooper Union  ...             $114,000.00
..                                            ...  ...                      ...
244                            Harvard University  ...             $124,000.00
245                    University of Pennsylvania  ...             $120,000.00
246                            Cornell University  ...             $110,000.00
247                              Brown University  ...             $109,000.00
248                           Columbia University  ...             $107,000.00

[249 rows x 4 columns]

In [16]:
pd.concat(dfs, ignore_index=True).drop_duplicates(subset=['School Name'], keep='first')

                                      School Name  ... Mid-Career Median Salary
0     Massachusetts Institute of Technology (MIT)  ...             $126,000.00
1        California Institute of Technology (CIT)  ...             $123,000.00
2                             Harvey Mudd College  ...             $122,000.00
3    Polytechnic University of New York, Brooklyn  ...             $114,000.00
4                                    Cooper Union  ...             $114,000.00
..                                            ...  ...                      ...
244                            Harvard University  ...             $124,000.00
245                    University of Pennsylvania  ...             $120,000.00
246                            Cornell University  ...             $110,000.00
247                              Brown University  ...             $109,000.00
248                           Columbia University  ...             $107,000.00

[249 rows x 4 columns]

In [17]:
ivies2 = ivies.set_index( 'School Name')

In [18]:
eng2 = eng.set_index('School Name')

In [19]:
pd.concat([ivies2,eng2], verify_integrity=True)

                                                    School Type  ... Mid-Career Median Salary
School Name                                                      ...
Dartmouth College                                    Ivy League  ...             $134,000.00
Princeton University                                 Ivy League  ...             $131,000.00
Yale University                                      Ivy League  ...             $126,000.00
Harvard University                                   Ivy League  ...             $124,000.00
University of Pennsylvania                           Ivy League  ...             $120,000.00
Cornell University                                   Ivy League  ...             $110,000.00
Brown University                                     Ivy League  ...             $109,000.00
Columbia University                                  Ivy League  ...             $107,000.00
Massachusetts Institute of Technology (MIT)         Engineering  ...             $126,000.00
California Institute of Technology (CIT)            Engineering  ...             $123,000.00
Harvey Mudd College                                 Engineering  ...             $122,000.00
Polytechnic University of New York, Brooklyn        Engineering  ...             $114,000.00
Cooper Union                                        Engineering  ...             $114,000.00
Worcester Polytechnic Institute (WPI)               Engineering  ...             $114,000.00
Carnegie Mellon University (CMU)                    Engineering  ...             $111,000.00
Rensselaer Polytechnic Institute (RPI)              Engineering  ...             $110,000.00
Georgia Institute of Technology                     Engineering  ...             $106,000.00
Colorado School of Mines                            Engineering  ...             $106,000.00
Stevens Institute of Technology                     Engineering  ...             $105,000.00
Illinois Institute of Technology (IIT)              Engineering  ...              $97,800.00
Wentworth Institute of Technology                   Engineering  ...              $96,700.00
Virginia Polytechnic Institute and State Univer...  Engineering  ...              $95,400.00
South Dakota School of Mines & Technology           Engineering  ...              $93,400.00
New Mexico Institute of Mining and Technology (...  Engineering  ...              $93,400.00
Rochester Institute of Technology (RIT)             Engineering  ...              $84,600.00
Embry-Riddle Aeronautical University (ERAU)         Engineering  ...              $80,700.00
Tennessee Technological University                  Engineering  ...              $80,000.00

[27 rows x 3 columns]

In [20]:
school_name_index = pd.concat([ivies2,eng2])

In [21]:
 random_rows = ivies2.sample()

In [22]:
random_rows

                    School Type Starting Median Salary Mid-Career Median Salary
School Name
Columbia University  Ivy League            $59,400.00              $107,000.00

In [23]:
eng3 = eng2.append(random_rows)

In [24]:
concat_ivies2_eng3 = pd.concat([ivies2,eng3])

In [25]:
concat_ivies2_eng3.duplicated()

School Name
Dartmouth College                                                      False
Princeton University                                                   False
Yale University                                                        False
Harvard University                                                     False
University of Pennsylvania                                             False
Cornell University                                                     False
Brown University                                                       False
Columbia University                                                    False
Massachusetts Institute of Technology (MIT)                            False
California Institute of Technology (CIT)                               False
Harvey Mudd College                                                    False
Polytechnic University of New York, Brooklyn                           False
Cooper Union                                                           False
Worcester Polytechnic Institute (WPI)                                  False
Carnegie Mellon University (CMU)                                       False
Rensselaer Polytechnic Institute (RPI)                                 False
Georgia Institute of Technology                                        False
Colorado School of Mines                                               False
Stevens Institute of Technology                                        False
Illinois Institute of Technology (IIT)                                 False
Wentworth Institute of Technology                                      False
Virginia Polytechnic Institute and State University (Virginia Tech)    False
South Dakota School of Mines & Technology                              False
New Mexico Institute of Mining and Technology (New Mexico Tech)        False
Rochester Institute of Technology (RIT)                                False
Embry-Riddle Aeronautical University (ERAU)                            False
Tennessee Technological University                                     False
Columbia University                                                     True
dtype: bool

In [26]:
dfc = pd.concat([liberal,state])

In [27]:
dfc.head()

           School Name  ... Mid-Career Median Salary
0  Bucknell University  ...             $110,000.00
1   Colgate University  ...             $108,000.00
2      Amherst College  ...             $107,000.00
3    Lafayette College  ...             $107,000.00
4      Bowdoin College  ...             $107,000.00

[5 rows x 4 columns]

In [28]:
 dfc.nunique()

School Name                 222
School Type                   2
Starting Median Salary      122
Mid-Career Median Salary    155
dtype: int64

In [29]:
dfc.iloc[:,3].replace('\$|,','',regex=True).astype(float).mean()

80856.3063063063

In [30]:
liberal2 = liberal.sort_values(by=['Mid-Career Median Salary'],ascending=False).iloc[:3].reset_index(drop=True)

In [31]:
state2 = state.sort_values(by=['Mid-Career Median Salary'],ascending=False).iloc[:3].reset_index(drop=True)

In [32]:
pd.concat([liberal2,state2],axis=1, keys=['Liberal Arts','State'],sort=False)

                                    Liberal Arts  ...                    State
                                     School Name  ... Mid-Career Median Salary
0  Wesleyan University (Middletown, Connecticut)  ...              $99,600.00
1                                  Bates College  ...              $97,600.00
2                                  Union College  ...              $96,700.00

[3 rows x 8 columns]

In [33]:
regions_url = '/content/drive/MyDrive/regions.csv'

In [34]:
regions = pd.read_csv(regions_url)

In [35]:
regions.head()

                                    School Name        Region
0   Massachusetts Institute of Technology (MIT)  Northeastern
1      California Institute of Technology (CIT)    California
2                           Harvey Mudd College    California
3  Polytechnic University of New York, Brooklyn  Northeastern
4                                  Cooper Union  Northeastern

In [36]:
schools.head()

                                    School Name  ... Mid-Career Median Salary
0   Massachusetts Institute of Technology (MIT)  ...             $126,000.00
1      California Institute of Technology (CIT)  ...             $123,000.00
2                           Harvey Mudd College  ...             $122,000.00
3  Polytechnic University of New York, Brooklyn  ...             $114,000.00
4                                  Cooper Union  ...             $114,000.00

[5 rows x 4 columns]

In [37]:
pd.merge(schools,regions)

                                      School Name  ...        Region
0     Massachusetts Institute of Technology (MIT)  ...  Northeastern
1        California Institute of Technology (CIT)  ...    California
2                             Harvey Mudd College  ...    California
3    Polytechnic University of New York, Brooklyn  ...  Northeastern
4                                    Cooper Union  ...  Northeastern
..                                            ...  ...           ...
264                            Harvard University  ...  Northeastern
265                    University of Pennsylvania  ...  Northeastern
266                            Cornell University  ...  Northeastern
267                              Brown University  ...  Northeastern
268                           Columbia University  ...  Northeastern

[269 rows x 5 columns]

In [38]:
income_url = '/content/drive/MyDrive/mid_career_salaries.csv'

In [39]:
mid_career = pd.read_csv(income_url)

In [40]:
schools.head()

                                    School Name  ... Mid-Career Median Salary
0   Massachusetts Institute of Technology (MIT)  ...             $126,000.00
1      California Institute of Technology (CIT)  ...             $123,000.00
2                           Harvey Mudd College  ...             $122,000.00
3  Polytechnic University of New York, Brooklyn  ...             $114,000.00
4                                  Cooper Union  ...             $114,000.00

[5 rows x 4 columns]

In [41]:
mid_career.head()

                                    school_name  ... Mid-Career 90th Percentile Salary
0   Massachusetts Institute of Technology (MIT)  ...                      $220,000.00
1      California Institute of Technology (CIT)  ...                               NaN
2                           Harvey Mudd College  ...                               NaN
3  Polytechnic University of New York, Brooklyn  ...                      $190,000.00
4                                  Cooper Union  ...                               NaN

[5 rows x 5 columns]

In [42]:
pd.merge(schools, mid_career, left_on='School Name', right_on='school_name').drop('school_name', axis=1)

                                      School Name  ... Mid-Career 90th Percentile Salary
0     Massachusetts Institute of Technology (MIT)  ...                      $220,000.00
1        California Institute of Technology (CIT)  ...                               NaN
2                             Harvey Mudd College  ...                               NaN
3    Polytechnic University of New York, Brooklyn  ...                      $190,000.00
4                                    Cooper Union  ...                               NaN
..                                            ...  ...                               ...
264                            Harvard University  ...                      $288,000.00
265                    University of Pennsylvania  ...                      $282,000.00
266                            Cornell University  ...                      $210,000.00
267                              Brown University  ...                      $228,000.00
268                           Columbia University  ...                      $241,000.00

[269 rows x 8 columns]

In [43]:
pd.merge(ivies,regions, how='inner')

                  School Name  ...        Region
0           Dartmouth College  ...  Northeastern
1        Princeton University  ...  Northeastern
2             Yale University  ...  Northeastern
3          Harvard University  ...  Northeastern
4  University of Pennsylvania  ...  Northeastern
5          Cornell University  ...  Northeastern
6            Brown University  ...  Northeastern
7         Columbia University  ...  Northeastern

[8 rows x 5 columns]

In [44]:
pd.merge(ivies,regions, how='outer')

                             School Name  ...        Region
0                      Dartmouth College  ...  Northeastern
1                   Princeton University  ...  Northeastern
2                        Yale University  ...  Northeastern
3                     Harvard University  ...  Northeastern
4             University of Pennsylvania  ...  Northeastern
..                                   ...  ...           ...
264         Austin Peay State University  ...      Southern
265           Pittsburg State University  ...    Midwestern
266             Southern Utah University  ...       Western
267  Montana State University - Billings  ...       Western
268         Black Hills State University  ...    Midwestern

[269 rows x 5 columns]

In [45]:
ivies

                  School Name  ... Mid-Career Median Salary
0           Dartmouth College  ...             $134,000.00
1        Princeton University  ...             $131,000.00
2             Yale University  ...             $126,000.00
3          Harvard University  ...             $124,000.00
4  University of Pennsylvania  ...             $120,000.00
5          Cornell University  ...             $110,000.00
6            Brown University  ...             $109,000.00
7         Columbia University  ...             $107,000.00

[8 rows x 4 columns]

In [46]:
pd.merge(ivies,regions, how='left')

                  School Name  ...        Region
0           Dartmouth College  ...  Northeastern
1        Princeton University  ...  Northeastern
2             Yale University  ...  Northeastern
3          Harvard University  ...  Northeastern
4  University of Pennsylvania  ...  Northeastern
5          Cornell University  ...  Northeastern
6            Brown University  ...  Northeastern
7         Columbia University  ...  Northeastern

[8 rows x 5 columns]

In [47]:
state

                                        School Name  ... Mid-Career Median Salary
0                University of California, Berkeley  ...             $112,000.00
1                      University of Virginia (UVA)  ...             $103,000.00
2                          Cal Poly San Luis Obispo  ...             $101,000.00
3    University of California at Los Angeles (UCLA)  ...             $101,000.00
4        University of California, San Diego (UCSD)  ...             $101,000.00
..                                              ...  ...                      ...
170                    Austin Peay State University  ...              $59,200.00
171                      Pittsburg State University  ...              $58,200.00
172                        Southern Utah University  ...              $56,500.00
173             Montana State University - Billings  ...              $50,600.00
174                    Black Hills State University  ...              $43,900.00

[175 rows x 4 columns]

In [48]:
state['School Name'].is_unique

True

In [49]:
regions['School Name'].is_unique

False

In [50]:
liberal.head(3
             )

           School Name  ... Mid-Career Median Salary
0  Bucknell University  ...             $110,000.00
1   Colgate University  ...             $108,000.00
2      Amherst College  ...             $107,000.00

[3 rows x 4 columns]

In [51]:
regions.head(3
             )

                                   School Name        Region
0  Massachusetts Institute of Technology (MIT)  Northeastern
1     California Institute of Technology (CIT)    California
2                          Harvey Mudd College    California

In [52]:
 dfm = pd.merge(liberal,regions,right_on='School Name', left_on='School Name')

In [53]:
dfm.Region.value_counts()

Northeastern    25
Midwestern       8
Western          7
Southern         5
California       3
Name: Region, dtype: int64

In [54]:
mid_career.head()

                                    school_name  ... Mid-Career 90th Percentile Salary
0   Massachusetts Institute of Technology (MIT)  ...                      $220,000.00
1      California Institute of Technology (CIT)  ...                               NaN
2                           Harvey Mudd College  ...                               NaN
3  Polytechnic University of New York, Brooklyn  ...                      $190,000.00
4                                  Cooper Union  ...                               NaN

[5 rows x 5 columns]

In [55]:
mid_career1 = mid_career.set_index('school_name')

In [57]:
mid_career1

                                             Mid-Career 10th Percentile Salary  ... Mid-Career 90th Percentile Salary
school_name                                                                     ...
Massachusetts Institute of Technology (MIT)                        $76,800.00   ...                      $220,000.00
California Institute of Technology (CIT)                                   NaN  ...                               NaN
Harvey Mudd College                                                        NaN  ...                               NaN
Polytechnic University of New York, Brooklyn                       $66,800.00   ...                      $190,000.00
Cooper Union                                                               NaN  ...                               NaN
...                                                                        ...  ...                               ...
Austin Peay State University                                       $32,200.00   ...                       $96,200.00
Pittsburg State University                                         $25,600.00   ...                      $117,000.00
Southern Utah University                                           $30,700.00   ...                      $116,000.00
Montana State University - Billings                                $22,600.00   ...                       $98,900.00
Black Hills State University                                       $27,000.00   ...                       $87,600.00

[269 rows x 4 columns]

In [61]:
mid_career1.isnull()

                                              Mid-Career 10th Percentile Salary  ...  Mid-Career 90th Percentile Salary
school_name                                                                      ...
Massachusetts Institute of Technology (MIT)                               False  ...                              False
California Institute of Technology (CIT)                                   True  ...                               True
Harvey Mudd College                                                        True  ...                               True
Polytechnic University of New York, Brooklyn                              False  ...                              False
Cooper Union                                                               True  ...                               True
...                                                                         ...  ...                                ...
Austin Peay State University                                              False  ...                              False
Pittsburg State University                                                False  ...                              False
Southern Utah University                                                  False  ...                              False
Montana State University - Billings                                       False  ...                              False
Black Hills State University                                              False  ...                              False

[269 rows x 4 columns]

In [62]:
mid_career1.fillna(0)

                                             Mid-Career 10th Percentile Salary  ... Mid-Career 90th Percentile Salary
school_name                                                                     ...
Massachusetts Institute of Technology (MIT)                        $76,800.00   ...                      $220,000.00
California Institute of Technology (CIT)                                     0  ...                                 0
Harvey Mudd College                                                          0  ...                                 0
Polytechnic University of New York, Brooklyn                       $66,800.00   ...                      $190,000.00
Cooper Union                                                                 0  ...                                 0
...                                                                        ...  ...                               ...
Austin Peay State University                                       $32,200.00   ...                       $96,200.00
Pittsburg State University                                         $25,600.00   ...                      $117,000.00
Southern Utah University                                           $30,700.00   ...                      $116,000.00
Montana State University - Billings                                $22,600.00   ...                       $98,900.00
Black Hills State University                                       $27,000.00   ...                       $87,600.00

[269 rows x 4 columns]